# Awari - Data Science

## Projeto - Python com SQLite

## 1. Considerações iniciais

Para que você assimile melhor os comandos do SQL, preparamos este projeto de Python com SQLite. Neste notebook Jupyter, você irá reforçando alguns conceitos da unidade atual e deverá executar algumas tarefas pelo caminho. Todo o projeto deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

### 1.1. Por que SQLite?
O SQLite é uma pequena biblioteca em C que possui um banco de dados SQL embutido. Sem o apoio de um poderoso SGDB (Sistema de Gerenciamento de Banco de Dados) como nas soluções do mercado, o SQLite é ideal para fins de aprendizagem, pois sua instalação é fácil e não requer nenhuma configuração inicial. Deste modo, podemos focar nos comandos do SQL.

### 1.2. Prepare seu ambiente
Baixe e instale o SQLite antes de começar. Resumidamente, você irá acessar a página de [Downloads](https://www.sqlite.org/download.html) do SQLite e baixar os executáveis para a mesma pasta deste notebook. Caso você encontre dificuldades:

- Assista a este [vídeo](https://www.youtube.com/watch?v=VcKKt6OTlJc) para "instalar" o SQLite no Windows ou;
- Ou siga este [manual](http://www.devfuria.com.br/linux/instalando-sqlite/) para as plataformas Linux.

### 1.3. Conjunto de dados

O conjunto de dados que iremos utilizar é derivado do [Titanic](https://www.kaggle.com/c/titanic/data). Na verdade, dividimos o conjunto em dois arquivos CSV - [passageiros](passageiros.csv) e [passagens](passagens.csv). Cada um destes arquivo serão inseridos dentro do SQLite como tabelas, onde você executará suas consultas SQL.

#### 1.3.1. Descrição do dados

No arquivo [passageiros](passageiros.csv), você encontrará:
- PassengerId: Id do passageiro
- Survived: Se o passageiro sobreviveu ou não. Se 0, então não sobreviveu. Se 1, sobreviveu.
- Pclass: Classe em que o passageiro estava viajando. Se 1, então estava na primeira classe e assim por diante.
- Name: Nome do passageiro.
- Sex: Gênero do passageiro. Masculino ou feminino.
- Age: Idade.
- Sibsp: número de irmãos / esposas a bordo do navio.
- Parch: número de pais / filhos a bordo do navio.

E no arquivo [passagens](passagens.csv):
- PassengerId: Id do passageiro
- Ticket: número do ticket de embarque
- Fare: valor pago pelo ticket.
- Cabin: cabine do passageiro.
- Embarked: porto de embarque do passageiro. C = Cherbourg, Q = Queenstown e S = Southampton

## 2. Procedimentos

### 2.1. Leitura dos arquivos CSV
Antes de importarmos os dados dentro das tabelas, precisamos começar lendo os arquivos CSV. O pequeno código abaixo importa os dados do CSV em uma lista de dicionários em Python.

In [2]:
import csv 

def importar_csv(arquivo):
    dados = []
    with open(arquivo) as arq:
        leitor = csv.DictReader(arq)
        for l in leitor:
            dados.append(dict(l))
    
    print('O conjunto de dados tem %s registros.' % len(dados))
    
    return dados

### TAREFA 01

1. Importe o arquivo passagens.csv usando o mesmo código anterior.
2. Atualize as partes contendo `...` com o que falta no seu código

**DICA**: Não reinvente a roda, reutilize a função anterior.

In [3]:
# Insira seu código aqui
passagens = importar_csv('passagens.csv')

O conjunto de dados tem 891 registros.

### TAREFA 02
1. Importe o arquivo passageiros.csv usando o mesmo código anterior.

In [4]:
# Insira seu código aqui

passageiros = importar_csv('passageiros.csv')

O conjunto de dados tem 891 registros.

### 2.2. Criando o banco de dados
Para manipular um banco SQLite com Python, temos que utilizar uma biblioteca específica.

In [5]:
import sqlite3
conn = sqlite3.connect('titanic.db')

O comando acima cria o arquivo [titanic.db](titanic.db), que armazará nossos dados.

### 2.3. Criando as tabelas
Neste momento, temos do dados e o banco SQLlite. Então é hora de começar à usar comandos SQL para criar as tabelas que armazenarão nossos dados dentro do banco.

No SQLlite, precisamos primeiro criar uma conexão e um cursor para executar nossos comandos no banco. Para facilicar, o código abaixo facilita este processo. Você só precisa passar seu comando SQL para a função.

In [6]:
def executa(comando):
    cursor = conn.cursor()
    cursor.execute(comando)
    cursor.close()

Não execute o comando abaixo, pois ele dá um erro. É só um exemplo

In [6]:
# Exemplo
#comando = '<SEU_COMANDO_AQUI>'
#executa(comando)

### TAREFA 03
1. Cria a tabela passageiros.
2. PassengerId deve ser a chave primária.
3. Atualize as partes contendo `...` com o que falta no seu código

In [9]:
# Insira seu código aqui
tabela_passageiros_comando = """
CREATE TABLE passageiros(PassengerId INTEGER NOT NULL PRIMARY KEY, Survived INTEGER NOT NULL, Pclass INTEGER NOT NULL, Name VARCHAR(200), Sex VARCHAR(20), Age INTEGER, SibSp INTEGER, Parch INTEGER);
"""

In [ ]:

executa(tabela_passageiros_comando)

### TAREFA 04
1. Cria a tabela passagens.
2. PassengerId deve ser a chave primária.
3. Atualize as partes contendo `...` com o que falta no seu código

In [11]:
# Insira seu código aqui
tabela_passagens_comando = """
CREATE TABLE passagens(PassengerId INTEGER NOT NULL PRIMARY KEY, Ticket VARCHAR(200), Fare DECIMAL(9,2), Cabin VARCHAR(20), Embarked VARCHAR(5));
"""

In [ ]:
executa(tabela_passagens_comando)

**Atenção:** Caso você tente executar os comandos de criação de tabelas mais de uma vez, perceberá um erro de operação informando que a tabela já existe.

Vamos verificar se as tabelas foram realmente criadas? Abra o terminal e na pasta atual digite:
```
$ sqlite3 titanic.db ".tables"
```
O terminal deve retornar com as tabelas existentes em seu banco [titanic.db](titanic.db). Neste casos, *passageiros* e *passagens*. Lembre-se que neste momento, não temos nenhum dado inseridos nas tabelas.

Caso queira verifcar mais algumas informações das tabelas criadas, pode executar esta outra instrução:
```
$ sqlite3 titanic.db "PRAGMA table_info(passageiros)"
```

### TAREFA 05
1. Pelo terminal, verifique mais informações da tabela passagens.

### 2.4. Inserindo dados nas tabelas
Usando o comando INSERT INTO, vamos popular as nossas tabelas. O processo é simples, percorremos as listas de dicionários, montamos nosso comando INSERT INTO e executamos - uma a uma. Para a tabela passageiros:

In [14]:
for p in passageiros:
    p['Name'] = p['Name'].replace('"', "'")
    inserir_passageiro = ("""
    INSERT INTO passageiros(PassengerId, Survived, Pclass, Name, Sex, Age, Sibsp, Parch)
    VALUES (%s, "%s", "%s", "%s", "%s", "%s", "%s", "%s")""") % (p['PassengerId'], p['Survived'], p['Pclass'],
                                                                 p['Name'], p['Sex'], p['Age'], p['SibSp'],
                                                                 p['Parch'])
    executa(inserir_passageiro)

### TAREFA 06
1. Insira os dados de passagens dentro da tabela passagens

In [15]:
# Insira seu código aqui
for p in passagens:
    inserir_passagens = ("""
    INSERT INTO passagens(PassengerId, Ticket, Fare, Cabin, Embarked)
    VALUES (%s, "%s", "%s", "%s", "%s")""") % (p['PassengerId'], p['Ticket'], p['Fare'], 
                                               p['Cabin'], p['Embarked'])
    executa(inserir_passagens)

### 2.5. Executando consultas
Agora que os dados estão inseridos no arquivo banco SQLite, vamos executar alguns consultas. Vamos começar fazendo uma seleção de todas as colunas das tabelas.

O comando SELECT retorna dados, deste modo, precisamos fazer alguma alteração na função executa. utilize o *executa_consulta()*.

In [16]:
def executa_consulta(consulta):
    cursor = conn.cursor()
    cursor.execute(consulta)
    for linha in cursor.fetchall():
        print(linha)
    
    cursor.close()

Testando nosso código. Repare que o comando LIMIT foi utilizado para limitar a quantidade de linhas.

In [17]:
consulta_passageiro = """SELECT * FROM PASSAGEIROS LIMIT 10"""
executa_consulta(consulta_passageiro)

(1, 0, 3, 'Braund, Mr. Owen Harris', 'male', 22, 1, 0)
(2, 1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female', 38, 1, 0)
(3, 1, 3, 'Heikkinen, Miss. Laina', 'female', 26, 0, 0)
(4, 1, 1, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'female', 35, 1, 0)
(5, 0, 3, 'Allen, Mr. William Henry', 'male', 35, 0, 0)
(6, 0, 3, 'Moran, Mr. James', 'male', '', 0, 0)
(7, 0, 1, 'McCarthy, Mr. Timothy J', 'male', 54, 0, 0)
(8, 0, 3, 'Palsson, Master. Gosta Leonard', 'male', 2, 3, 1)
(9, 1, 3, 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)', 'female', 27, 0, 2)
(10, 1, 2, 'Nasser, Mrs. Nicholas (Adele Achem)', 'female', 14, 1, 0)

In [16]:
consulta_passagens = """SELECT * FROM PASSAGENS LIMIT 10"""
executa_consulta(consulta_passagens)

(1, 'A/5 21171', 7.25, '', 'S')
(2, 'PC 17599', 71.2833, 'C85', 'C')
(3, 'STON/O2. 3101282', 7925, '', 'S')
(4, '113803', 53.1, 'C123', 'S')
(5, '373450', 8.05, '', 'S')
(6, '330877', 8.4583, '', 'Q')
(7, '17463', 51.8625, 'E46', 'S')
(8, '349909', 21075, '', 'S')
(9, '347742', 11.1333, '', 'S')
(10, '237736', 30.0708, '', 'C')

Também podemos imprimir mais informações sobre uma tabela usando o seguinte comando:

In [17]:
executa_consulta('pragma table_info(passageiros)')

(0, 'PassengerId', 'INTEGER', 1, None, 1)
(1, 'Survived', 'INTEGER', 1, None, 0)
(2, 'Pclass', 'INTEGER', 1, None, 0)
(3, 'Name', 'VARCHAR(200)', 0, None, 0)
(4, 'Sex', 'VARCHAR(20)', 0, None, 0)
(5, 'Age', 'INTEGER', 0, None, 0)
(6, 'SibSp', 'INTEGER', 0, None, 0)
(7, 'Parch', 'INTEGER', 0, None, 0)

### TAREFA 07
1. Verifique quantos tipos de classe (PClass) existem na tabela passageiros.

In [ ]:
# Insira seu código aqui

consulta = """"SELECT p.Pclass FROM passageiros AS p GROUP BY p.Pclass"""
executa_consulta(consulta)

### TAREFA 08
1. Selecione os passageiros do sexo masculino (Sex) e que estejam na segunda classe (PClass).

**DICA**: Use a cláusula WHERE e uma condicional (AND ou OR).

In [19]:
# Insira seu código aqui

consulta = """SELECT  * FROM PASSAGEIROS WHERE (Sex='male' AND PClass = 2)"""
executa_consulta(consulta)

(18, 1, 2, 'Williams, Mr. Charles Eugene', 'male', '', 0, 0)
(21, 0, 2, 'Fynney, Mr. Joseph J', 'male', 35, 0, 0)
(22, 1, 2, 'Beesley, Mr. Lawrence', 'male', 34, 0, 0)
(34, 0, 2, 'Wheadon, Mr. Edward H', 'male', 66, 0, 0)
(71, 0, 2, 'Jenkin, Mr. Stephen Curnow', 'male', 32, 0, 0)
(73, 0, 2, 'Hood, Mr. Ambrose Jr', 'male', 21, 0, 0)
(79, 1, 2, 'Caldwell, Master. Alden Gates', 'male', 0.83, 0, 2)
(100, 0, 2, 'Kantor, Mr. Sinai', 'male', 34, 1, 0)
(118, 0, 2, 'Turpin, Mr. William John Robert', 'male', 29, 1, 0)
(121, 0, 2, 'Hickman, Mr. Stanley George', 'male', 21, 2, 0)
(123, 0, 2, 'Nasser, Mr. Nicholas', 'male', 32.5, 1, 0)
(135, 0, 2, 'Sobey, Mr. Samuel James Hayden', 'male', 25, 0, 0)
(136, 0, 2, 'Richard, Mr. Emile', 'male', 23, 0, 0)
(145, 0, 2, 'Andrew, Mr. Edgardo Samuel', 'male', 18, 0, 0)
(146, 0, 2, 'Nicholls, Mr. Joseph Charles', 'male', 19, 1, 1)
(149, 0, 2, "Navratil, Mr. Michel ('Louis M Hoffman')", 'male', 36.5, 0, 2)
(150, 0, 2, 'Byles, Rev. Thomas Roussel Davids', 'male', 42, 0, 0)
(151, 0, 2, 'Bateman, Rev. Robert James', 'male', 51, 0, 0)
(179, 0, 2, 'Hale, Mr. Reginald', 'male', 30, 0, 0)
(182, 0, 2, 'Pernot, Mr. Rene', 'male', '', 0, 0)
(184, 1, 2, 'Becker, Master. Richard F', 'male', 1, 2, 1)
(192, 0, 2, 'Carbines, Mr. William', 'male', 19, 0, 0)
(194, 1, 2, 'Navratil, Master. Michel M', 'male', 3, 1, 1)
(214, 0, 2, 'Givard, Mr. Hans Kristensen', 'male', 30, 0, 0)
(218, 0, 2, 'Jacobsohn, Mr. Sidney Samuel', 'male', 42, 1, 0)
(220, 0, 2, 'Harris, Mr. Walter', 'male', 30, 0, 0)
(222, 0, 2, 'Bracken, Mr. James H', 'male', 27, 0, 0)
(227, 1, 2, 'Mellors, Mr. William John', 'male', 19, 0, 0)
(229, 0, 2, 'Fahlstrom, Mr. Arne Jonas', 'male', 18, 0, 0)
(233, 0, 2, 'Sjostedt, Mr. Ernst Adolf', 'male', 59, 0, 0)
(235, 0, 2, 'Leyson, Mr. Robert William Norman', 'male', 24, 0, 0)
(237, 0, 2, 'Hold, Mr. Stephen', 'male', 44, 1, 0)
(239, 0, 2, 'Pengelly, Mr. Frederick William', 'male', 19, 0, 0)
(240, 0, 2, 'Hunt, Mr. George Henry', 'male', 33, 0, 0)
(243, 0, 2, 'Coleridge, Mr. Reginald Charles', 'male', 29, 0, 0)
(250, 0, 2, 'Carter, Rev. Ernest Courtenay', 'male', 54, 1, 0)
(266, 0, 2, 'Reeves, Mr. David', 'male', 36, 0, 0)
(278, 0, 2, "Parkes, Mr. Francis 'Frank'", 'male', '', 0, 0)
(289, 1, 2, 'Hosono, Mr. Masabumi', 'male', 42, 0, 0)
(293, 0, 2, 'Levy, Mr. Rene Jacques', 'male', 36, 0, 0)
(309, 0, 2, 'Abelson, Mr. Samuel', 'male', 30, 1, 0)
(315, 0, 2, 'Hart, Mr. Benjamin', 'male', 43, 1, 1)
(318, 0, 2, 'Moraweck, Dr. Ernest', 'male', 54, 0, 0)
(341, 1, 2, 'Navratil, Master. Edmond Roger', 'male', 2, 1, 1)
(343, 0, 2, 'Collander, Mr. Erik Gustaf', 'male', 28, 0, 0)
(344, 0, 2, 'Sedgwick, Mr. Charles Frederick Waddington', 'male', 25, 0, 0)
(345, 0, 2, 'Fox, Mr. Stanley Hubert', 'male', 36, 0, 0)
(362, 0, 2, 'del Carlo, Mr. Sebastiano', 'male', 29, 1, 0)
(386, 0, 2, 'Davies, Mr. Charles Henry', 'male', 18, 0, 0)
(398, 0, 2, 'McKane, Mr. Peter David', 'male', 46, 0, 0)
(399, 0, 2, 'Pain, Dr. Alfred', 'male', 23, 0, 0)
(406, 0, 2, 'Gale, Mr. Shadrach', 'male', 34, 1, 0)
(408, 1, 2, 'Richards, Master. William Rowe', 'male', 3, 1, 1)
(414, 0, 2, 'Cunningham, Mr. Alfred Fleming', 'male', '', 0, 0)
(419, 0, 2, 'Matthews, Mr. William John', 'male', 30, 0, 0)
(440, 0, 2, 'Kvillner, Mr. Johan Henrik Johannesson', 'male', 31, 0, 0)
(451, 0, 2, 'West, Mr. Edwy Arthur', 'male', 36, 1, 2)
(464, 0, 2, 'Milling, Mr. Jacob Christian', 'male', 48, 0, 0)
(467, 0, 2, 'Campbell, Mr. William', 'male', '', 0, 0)
(477, 0, 2, 'Renouf, Mr. Peter Henry', 'male', 34, 1, 0)
(482, 0, 2, "Frost, Mr. Anthony Wood 'Archie'", 'male', '', 0, 0)
(530, 0, 2, 'Hocking, Mr. Richard George', 'male', 23, 2, 1)
(544, 1, 2, 'Beane, Mr. Edward', 'male', 32, 1, 0)
(548, 1, 2, 'Padro y Manent, Mr. Julian', 'male', '', 0, 0)
(550, 1, 2, 'Davies, Master. John Morgan Jr', 'male', 8, 1, 1)
(552, 0, 2, 'Sharp, Mr. Percival James R', 'male', 27, 0, 0)
(563, 0, 2, 'Norman, Mr. Robert Douglas', 'male', 28, 0, 0)
(571, 1, 2, 'Harris, Mr. George', 'male', 62, 0, 0)
(583, 0, 2, 'Downton, Mr. William James', 'male', 54, 0, 0)
(587, 0, 2, 'Jarvis, Mr. John Denzil', 'male', 47, 0, 0)
(595, 0, 2, 'Chapman, Mr. John Henry', 'male', 37, 1, 0)
(620, 0, 2, 'Gavey, Mr. Lawrence', 'male', 26, 0, 0)
(627, 0, 2, 'Kirkland, Rev. Charles Leonard', 'male', 57, 0, 0)
(638, 0, 2, 'Collyer, Mr. Harvey', 'male', 31, 1, 1)
(656, 0, 2, 'Hickman, Mr. Leonard Mark', 'male', 24, 2, 0)
(659, 0, 2, 'Eitemiller, Mr. George Floyd', 'male', 23, 0, 0)
(666, 0, 2, 'Hickman, Mr. Lewis', 'male', 32, 2, 0)
(667, 0, 2, 'Butler, Mr. Reginald Fenton', 'male', 25, 0, 0)
(673, 0, 2, 'Mitchell, Mr. Henry Michael', 'male', 70, 0, 0)
(674, 1, 2, 'Wilhelms, Mr. Charles', 'male', 31, 0, 0)
(675, 0, 2, 'Watson, Mr. Ennis Hastings', 'male', '', 0, 0)
(685, 0, 2, 'Brown, Mr. Thomas William Solomon', 'male', 60, 1, 1)
(686, 0, 2, 'Laroche, Mr. Joseph Philippe Lemercier', 'male', 25, 1, 2)
(696, 0, 2, 'Chapman, Mr. Charles Henry', 'male', 52, 0, 0)
(706, 0, 2, "Morley, Mr. Henry Samuel ('Mr Henry Marshall')", 'male', 39, 0, 0)
(715, 0, 2, 'Greenberg, Mr. Samuel', 'male', 52, 0, 0)
(723, 0, 2, 'Gillespie, Mr. William Henry', 'male', 34, 0, 0)
(724, 0, 2, 'Hodges, Mr. Henry Price', 'male', 50, 0, 0)
(729, 0, 2, 'Bryhl, Mr. Kurt Arnold Gottfrid', 'male', 25, 1, 0)
(733, 0, 2, 'Knight, Mr. Robert J', 'male', '', 0, 0)
(734, 0, 2, 'Berriman, Mr. William John', 'male', 23, 0, 0)
(735, 0, 2, 'Troupiansky, Mr. Moses Aaron', 'male', 23, 0, 0)
(756, 1, 2, 'Hamalainen, Master. Viljo', 'male', 0.67, 1, 1)
(758, 0, 2, 'Bailey, Mr. Percy Andrew', 'male', 18, 0, 0)
(792, 0, 2, 'Gaskell, Mr. Alfred', 'male', 16, 0, 0)
(796, 0, 2, 'Otter, Mr. Richard', 'male', 39, 0, 0)
(801, 0, 2, 'Ponesell, Mr. Martin', 'male', 34, 0, 0)
(809, 0, 2, 'Meyer, Mr. August', 'male', 39, 0, 0)
(813, 0, 2, 'Slemen, Mr. Richard James', 'male', 35, 0, 0)
(818, 0, 2, 'Mallet, Mr. Albert', 'male', 31, 1, 1)
(828, 1, 2, 'Mallet, Master. Andre', 'male', 1, 0, 2)
(832, 1, 2, 'Richards, Master. George Sibley', 'male', 0.83, 1, 1)
(842, 0, 2, 'Mudd, Mr. Thomas Charles', 'male', 16, 0, 0)
(849, 0, 2, 'Harper, Rev. John', 'male', 28, 0, 1)
(862, 0, 2, 'Giles, Mr. Frederick Edward', 'male', 21, 1, 0)
(865, 0, 2, 'Gill, Mr. John William', 'male', 24, 0, 0)
(884, 0, 2, 'Banfield, Mr. Frederick James', 'male', 28, 0, 0)
(887, 0, 2, 'Montvila, Rev. Juozas', 'male', 27, 0, 0)

### TAREFA 09
1. Conte quantos passageiros existem por sexo.

**DICA**: Use GROUP BY e COUNT().

In [28]:
# Insira seu código aqui


consulta = """SELECT p.Sex, count() FROM passageiros as p GROUP BY p.Sex"""

executa_consulta(consulta)

('female', 314)
('male', 577)

### TAREFA 10
1. Verifique o valor médio das passagens em cada porto de embarque

**DICA**: Use GROUP BY e AVG(). A presença de valores missing pode apresentar alguns resultados estranhos.

In [29]:
consulta= "SELECT psg.Embarked, avg(psg.Fare) FROM passagens as psg GROUP BY psg.Embarked"

Exemplo:
    
SELECT nome_columa1, nome_columa2
   FROM tabela1
   WHERE nome_columa1 > value
   GROUP BY nome_columa1, nome_columa2
    
    
OBS: A cláusula GROUP BY pode ser usada com ou sem uma função agregada (max, sum, count, avg, ...)

In [32]:
# Insira seu código aqui


consulta = """SELECT psg.Embarked, avg(psg.Fare) 
FROM passagens as psg GROUP BY psg.Embarked"""
executa_consulta(consulta)

('', 80.0)
('C', 12709.34566190476)
('Q', 2002.8429129870128)
('S', 2015.3069857142902)

### TAREFA 11
1. Selecione o nome (Name), sexo(Sex) e tarifa(Fare) paga de 5 passageiros
2. Utilize as tabelas passageiros e passagens.

**DICA**: Use JOIN.

consulta = """SELECT ... FROM ... INNER JOIN ... ON ... LIMIT ..."""
executa_consulta(consulta)

In [33]:
# Insira seu código aqui

consulta = """SELECT Name, Sex, Fare FROM passageiros INNER JOIN 
                Passagens ON Passageiros.passengerId = Passagens.PassengerId LIMIT+5"""


executa_consulta(consulta)

('Braund, Mr. Owen Harris', 'male', 7.25)
('Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female', 71.2833)
('Heikkinen, Miss. Laina', 'female', 7925)
('Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'female', 53.1)
('Allen, Mr. William Henry', 'male', 8.05)

### TAREFA 12
1. Selecione o valor máximo (Fare) das passagens por classe.

In [34]:
# Insira seu código aqui

consulta = """SELECT p.Pclass, max(psg.Fare) 
FROM passageiros as p INNER JOIN passagens as psg 
ON p.PassengerID = psg.PassengerId GROUP BY p.Pclass"""

executa_consulta(consulta)

(1, 262375)
(2, 12875)
(3, 34375)

### TAREFA 13
1. Descubra quantas pessoas embarcaram por porto
2. Agrupando por porto e sexo.

Portos => C = Cherbourg, Q = Queenstown e S = Southampton

In [35]:
# Insira seu código aqui:

consulta = """SELECT psg.Embarked, p.Sex, count() 
FROM passageiros AS p, passagens as psg 
WHERE p.PassengerId = psg.PassengerId GROUP BY psg.Embarked, p.Sex"""

executa_consulta(consulta)

('', 'female', 2)
('C', 'female', 73)
('C', 'male', 95)
('Q', 'female', 36)
('Q', 'male', 41)
('S', 'female', 203)
('S', 'male', 441)

## 3. Conclusão

A quantidade de consultas e a lista de comandos SQL é enorme. A interação foi somente relembrar alguns comandos básicos para que você se sinta confortável para explorar qualquer banco de dados SQL que você encontrar.

### Awari -  <a href="https://awari.com.br/"> awari.com.br</a>